Autodesk.Revit.DB.FaceSecondDerivatives.GetFaceSecondDerivatives(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.UV)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FaceSecondDerivatives.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FaceSecondDerivatives.MixedDerivative
The mixed derivative.
Since:
2016

Autodesk.Revit.DB.FaceSecondDerivatives.VVDerivative
The second derivative with respect to V.
Since:
2016

Autodesk.Revit.DB.FaceSecondDerivatives.UUDerivative
The second derivative with respect to U.
Since:
2016

Autodesk.Revit.DB.FaceSecondDerivatives
Contains second partial derivatives of a face at a specified point.
Since:
2016